<?php
/*
+	Сложение	$a + $b
-	Вычитание	$a - $b
*	Умножение	$a * $b
/	Деление	$a / $b
%	Остаток от деления	$a % $b
.	Конкатенация строк	$a . $b
=	Присваивание	$a = $b
+=	Сложение с присваиванием	$a += $b
-=	Вычитание с присваиванием	$a -= $b
*=	Умножение с присваиванием	$a *= $b
/=	Деление с присваиванием	$a /= $b
%=	Остаток от деления с присваиванием	$a %= $b
==	Равно	$a == $b
===	Тождественно равно	$a === $b
!=	Не равно	$a != $b
<>	Не равно (альтернативная запись)	$a <> $b
!==	Не тождественно равно	$a !== $b
<	Меньше	$a < $b
>	Больше	$a > $b
<=	Меньше или равно	$a <= $b
>=	Больше или равно	$a >= $b
++	Инкремент	$a++ или ++$a
--	Декремент	$a-- или --$a
*/