<?php
/*
----------------------------------------------------------------------------------------------------------------------- 
|   Типы web-приложений   |    Применяемые технологии                                                                 |
----------------------------------------------------------------------------------------------------------------------- 
|   Серверные приложения  |    Python, Java, Ruby, PHP, C# и Т.Д Тут же находится и база данных.                      |
----------------------------------------------------------------------------------------------------------------------- 
|   Клиентские приложения |    Приложения на стороне клиента использующие JS HTML CSS для работы.                     |
----------------------------------------------------------------------------------------------------------------------- 
|   SPA                   |    Это одностраничные веб приложения                                                      |
|                         |    Использует AJAX для обновления контента на стороне клиента                             |
|                         |    Постоянно общаются с сервером для получения и передачи различных данных.               |
-----------------------------------------------------------------------------------------------------------------------
|   PWA                   |    Совершенно новый способ создания и работы web-сервисов.                                |
|                         |    Устанавливается на телефон как и другая программа браузером в виде ярлыка.             |
|                         |    Работает без доступа в сеть.                                                           |
|                         |    Использует JS HTML CSS.                                                                |
----------------------------------------------------------------------------------------------------------------------- 
|   MPA                   |     Сложная многостраничная система, любые изменения приводят к обновлению всей страницы. |
|                         |     Это смесь между серверным и клиентским приложением.                                   |
-----------------------------------------------------------------------------------------------------------------------
*/
?>