<?php
/*
Agile - это способ создания компьютерных программ, который помогает людям работать более гибко и эффективно. 
Agile работает так:
    Гибкость и адаптивность: Мы знаем, что планы могут меняться, поэтому мы делаем процессы, которые легко изменять.
    Инкрементальная разработка: Мы делаем программу кусочками и добавляем новые штучки постепенно. Это помогает нам быстрее понять, что нужно улучшить.
    Активное взаимодействие с заказчиком: Мы постоянно говорим с людьми, для которых делаем программу, чтобы понимать, что они хотят, и как мы можем это сделать лучше.
    Самоорганизующиеся команды: Нам нравится, когда команда сама может принимать решения и организовывать свою работу.
    Постоянное качество продукта: Мы всегда стараемся делать хороший продукт, поэтому постоянно проверяем его качество и улучшаем процессы разработки.
    Простота и минимализм: Мы стараемся делать все просто и понятно, чтобы было легче работать и поддерживать программу.
    Регулярные релизы и обратная связь: Мы часто выпускаем новые версии программы, чтобы пользователи могли быстро получать новые функции и давать обратную связь.
*/
?>